## 40 SQL Query Questions and Answers for Practice

### Sample Table – Worker
![](images/s1.png)

## Sample Table – Bonus
![](images/s1.png)

## Sample Table – Title
![](images/s3.png)

## SQL Script to Seed Sample Data.
```
CREATE DATABASE ORG;
SHOW DATABASES;
USE ORG;

CREATE TABLE Worker (
	WORKER_ID INT NOT NULL PRIMARY KEY AUTO_INCREMENT,
	FIRST_NAME CHAR(25),
	LAST_NAME CHAR(25),
	SALARY INT(15),
	JOINING_DATE DATETIME,
	DEPARTMENT CHAR(25)
);

INSERT INTO Worker 
	(WORKER_ID, FIRST_NAME, LAST_NAME, SALARY, JOINING_DATE, DEPARTMENT) VALUES
		(001, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
		(002, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'),
		(003, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR'),
		(004, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin'),
		(005, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin'),
		(006, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account'),
		(007, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account'),
		(008, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin');

CREATE TABLE Bonus (
	WORKER_REF_ID INT,
	BONUS_AMOUNT INT(10),
	BONUS_DATE DATETIME,
	FOREIGN KEY (WORKER_REF_ID)
		REFERENCES Worker(WORKER_ID)
        ON DELETE CASCADE
);

INSERT INTO Bonus 
	(WORKER_REF_ID, BONUS_AMOUNT, BONUS_DATE) VALUES
		(001, 5000, '16-02-20'),
		(002, 3000, '16-06-11'),
		(003, 4000, '16-02-20'),
		(001, 4500, '16-02-20'),
		(002, 3500, '16-06-11');

CREATE TABLE Title (
	WORKER_REF_ID INT,
	WORKER_TITLE CHAR(25),
	AFFECTED_FROM DATETIME,
	FOREIGN KEY (WORKER_REF_ID)
		REFERENCES Worker(WORKER_ID)
        ON DELETE CASCADE
);

INSERT INTO Title 
	(WORKER_REF_ID, WORKER_TITLE, AFFECTED_FROM) VALUES
 (001, 'Manager', '2016-02-20 00:00:00'),
 (002, 'Executive', '2016-06-11 00:00:00'),
 (008, 'Executive', '2016-06-11 00:00:00'),
 (005, 'Manager', '2016-06-11 00:00:00'),
 (004, 'Asst. Manager', '2016-06-11 00:00:00'),
 (007, 'Executive', '2016-06-11 00:00:00'),
 (006, 'Lead', '2016-06-11 00:00:00'),
 (003, 'Lead', '2016-06-11 00:00:00');
 
```

### 1.Write an SQL query to fetch “FIRST_NAME” from Worker table using the alias name as WORKER_NAME.
```
SELECT FIRST_NAME AS WORKER_NAME FROM ORG.Worker;
```

### 2.Write an SQL query to fetch “FIRST_NAME” from Worker table in upper case.
```
SELECT UPPER( FIRST_NAME) FROM ORG.Worker;
```

### 3.Write an SQL query to fetch unique values of DEPARTMENT from Worker table.
This query returns DEPARTMENT Column from table
```
SELECT DEPARTMENT  FROM ORG.Worker;
```

This query gives the unique values of DEPARTMENT column
```
SELECT DISTINCT (DEPARTMENT)  FROM ORG.Worker;
```

### 4.Write an SQL query to print the first three characters of  FIRST_NAME from Worker table.
```
SELECT SUBSTRING(FIRST_NAME,1,3) FROM ORG.Worker; 
```



## Explanation of SUBSTRING() function :
 - Function in MySQL is used to derive substring from any given string .It extracts a string with a specified length, starting from a given location in an input string. The purpose of substring is to return a specific portion of the string.

#### Syntax :
```
SUBSTRING(string, start, length)
OR
SUBSTRING(string FROM start FOR length)
```
### Parameters :

- string – Input String from which to extract.
- start – The starting position. If it is a positive number, this function extracts from the beginning of the string. If it is a negative number, this function extracts from the end of the string.
- length – It is optional. It identifies the number of characters to extract. If it is not given The whole string is returned from the starting position.

### 5. Write an SQL query to find the position of the alphabet (‘a’) in the first name column ‘Amitabh’ from Worker table.

```
SELECT INSTR(BINARY FIRST_NAME,'a') FROM ORG.Worker 
WHERE FIRST_NAME = 'Amitabh';
```


## Explanation of INSTR() function:
- This function in MySQL is used to return the location of the first occurrence of a substring within a given string.

#### Syntax :
```
INSTR(string_1, string_2)
``` 

#### Parameters :
This function accepts 2 parameters.

- string_1 – The string where searching takes place.
- string_2 – The string/sub-string which will be searched in string_1.


#### Returns :
It returns the position of the first occurrence of a substring within a given string.
#### Note:
 >- The function will return 0 if string_2 is not found in string_1.
 >- INSTR() function only performs case-insensitive searches.
 >- Using Binary operator will make INSTR work as the case-sensitive function.
 
### Examples:
```
SELECT INSTR("Python is a powerful Language", "powerful")  AS Found;
```
 
 
```
SELECT  
 INSTR("Python is a powerful Language", "IS")  AS 'Found1';
 INSTR("Python is a powerful Language", "is")  AS 'Found2';
```

### 6. Write an SQL query to print the FIRST_NAME from Worker table after removing white spaces from the right side.
```
SELECT RTRIM(FIRST_NAME) FROM ORG.Worker; 
```

###### ------------------------------------------------------------------------------------------
### Explanation of LTRIM() Function:
- This function in MySQL is used to remove leading spaces from a string.

#### Syntax :
```
LTRIM(str)
```

#### Parameter :
- str – The string from which we want to remove leading spaces.

#### Returns :
- It returns a string after truncating all leading spaces.

###### ------------------------------------------------------------------------------------------------

### Explanation of RTRIM() Function:
- This function in MySQL is used to remove trailing spaces from a string.

#### Syntax :
```
RTRIM(str)
```

#### Parameter :
- str – The string from which we want to remove trailing spaces.

#### Returns :
- It returns a string after truncating all trailing spaces.

### 7. Write an SQL query that fetches the unique values of DEPARTMENT from Worker table and prints its length.
- This query gives us just count of all the unique values means a single value is returnted by this query.

```
SELECT COUNT(DISTINCT DEPARTMENT) FROM ORG.Worker;
```
------------------------
- This query gives us count value of each column's unique entry. 
```
SELECT DISTINCT LENGTH(DEPARTMENT) FROM ORG.Worker;
```
-----------------------
- This query returns count value of each column's unique entry with column name.
```
SELECT DISTINCT LENGTH(DEPARTMENT), DEPARTMENT  FROM ORG.Worker;
```

### 8. Write an SQL query to print the FIRST_NAME from Worker table after replacing ‘a’ with ‘A’.
```
SELECT REPLACE(FIRST_NAME,'a', 'A') FROM ORG.Worker;
```


#### REPLACE() function
- MySQL REPLACE() replaces all the occurrences of a substring within a string.

#### Syntax:
```
REPLACE(str, find_string, replace_with)
```
#### Arguments:
- find_string : A string which is present one or more times within the string str.
- replace_with : A string which will replace every time it finds find_string within str

#### Note:
>- It is a case-sensitive function.

### 9. Write an SQL query to print the FIRST_NAME and LAST_NAME from Worker table into a single column COMPLETE_NAME. A space char should separate them.
```
SELECT CONCAT(FIRST_NAME, ' ', LAST_NAME) AS FULL_NAME FROM ORG.Worker;
```

### 10. Write an SQL query to print all Worker details from the Worker table order by FIRST_NAME Ascending.
```
SELECT * FROM ORG.Worker ORDER BY FIRST_NAME ASC;
```

### 11. Write an SQL query to print all Worker details from the Worker table order by FIRST_NAME Ascending and DEPARTMENT Descending.
```
SELECT * FROM ORG.Worker 
ORDER BY FIRST_NAME ASC, DEPARTMENT DESC ;
```

### 12. Write an SQL query to print details for Workers with the first name as “Vipul” and “Satish” from Worker table.
- First Method
```
SELECT * FROM ORG.Worker 
WHERE (FIRST_NAME = 'Vipul') or (FIRST_NAME = 'Satish');
```

- Second Method
```
SELECT * FROM ORG.Worker 
WHERE FIRST_NAME in ('Vipul', 'Satish');
```

------------------------
### MySQL IN Condition
- The MySQL IN condition is used to reduce the use of multiple OR conditions in a SELECT, INSERT, UPDATE and DELETE statement.

#### Syntax:
```
expression IN (value1, value2, .... value_n);
```

#### Parameters
- value1, value2, ... or value_n: These are the values to test against expression. If any of these values matches expression, then the IN condition will evaluate to true. This is a quick method to test if any one of the values matches expression.

### 13.  Write an SQL query to print details of workers excluding first names, “Vipul” and “Satish” from Worker table.
```
SELECT * FROM ORG.Worker 
WHERE FIRST_NAME not in ('Vipul', 'Satish');
```

### 14. Write an SQL query to print details of Workers with DEPARTMENT name as “Admin”.
First Method
```
SELECT * FROM ORG.Worker 
WHERE DEPARTMENT ='Admin';
```

Second Method
```
SELECT * FROM ORG.Worker 
WHERE DEPARTMENT like 'Admin';
```

### 15. Write an SQL query to print details of the Workers whose FIRST_NAME contains ‘a’.
```
SELECT * FROM ORG.Worker 
WHERE FIRST_NAME  LIKE '%a%';
```

### 16. Write an SQL query to print details of the Workers whose FIRST_NAME ends with ‘a’.
```
SELECT * FROM ORG.Worker 
WHERE FIRST_NAME  LIKE '%a';
```

### 17. Write an SQL query to print details of the Workers whose FIRST_NAME ends with ‘h’ and contains six alphabets.
```
SELECT * FROM ORG.Worker 
WHERE FIRST_NAME LIKE '______a';
```

### 18. Write an SQL query to print details of the Workers whose SALARY lies between 100000 and 500000.
- First Method:
```
SELECT * FROM ORG.Worker 
WHERE SALARY BETWEEN 100000 AND 900000;
```

- Second Method
```
SELECT * FROM ORG.Worker 
WHERE SALARY >= 100000 AND SALARY <= 900000;
```

### 19. Write an SQL query to print details of the Workers who have joined in Feb’2014.
```
SELECT * FROM ORG.Worker 
WHERE year(JOINING_DATE)= 2014 and month(JOINING_DATE) = 2;
```

### 20. Write an SQL query to fetch the count of employees working in the department ‘Admin’.

```
SELECT COUNT(*) FROM ORG.Worker 
WHERE DEPARTMENT ='Admin'; 
```

### 21. Write an SQL query to fetch worker names with salaries >= 50000 and <= 100000.
- First Method

```
SELECT CONCAT(FIRST_NAME,' ', LAST_NAME ) AS WORK_NAMES, SALARY  FROM ORG.Worker 
WHERE SALARY >= 50000 AND SALARY <= 100000;
``` 

- Second Method
```
SELECT CONCAT(FIRST_NAME,' ', LAST_NAME ) AS WORK_NAMES, SALARY  FROM ORG.Worker 
WHERE SALARY BETWEEN  50000 AND 100000;
```

- Third Method
```
SELECT CONCAT(FIRST_NAME, ' ', LAST_NAME) As Worker_Name, Salary
FROM ORG.Worker 
WHERE WORKER_ID IN 
(SELECT WORKER_ID FROM Worker 
WHERE Salary BETWEEN 50000 AND 100000);
```

### 22. Write an SQL query to fetch the no. of workers for each department in the descending order.
```
SELECT COUNT(DEPARTMENT) AS NO_OF_WORKERS, DEPARTMENT 
FROM ORG.Worker
GROUP BY DEPARTMENT
ORDER BY NO_OF_WORKERS DESC;
```

### 23.  Write an SQL query to print details of the Workers who are also Managers.

```
SELECT CONCAT(W.FIRST_NAME,' ', W.LAST_NAME) AS WORKER_NAME, T.WORKER_TITLE
FROM Worker W
INNER JOIN Title T 
ON W.WORKER_ID = T.WORKER_REF_ID 
AND T.WORKER_TITLE IN ('Manager');
```

### 24. Write an SQL query to fetch duplicate records having matching data in some fields of a title table like worker_title, affected_from.
```
SELECT WORKER_TITLE, AFFECTED_FROM , COUNT(*)
FROM Title
GROUP BY WORKER_TITLE, AFFECTED_FROM
HAVING COUNT(*)>1;
```

### 25. Write an SQL query to show only odd rows from a table.

```
SELECT * FROM ORG.Worker w WHERE MOD(WORKER_ID,2) <> 0;
```

- Here MOD(WORKER_ID, 2) <> 0 , IT means that if worker_id is divided by 2 and its reminder is not equal to 0.

### 26. Write an SQL query to show only even rows from a table.
```
SELECT * FROM Worker w 
WHERE MOD(WORKER_ID ,2)=0;
```

### 27. Write an SQL query to show the current date and time.

- Following MySQL query returns the current date:
```
SELECT CURDATE();
```

- Following MySQL query returns the current date and time:
```
SELECT NOW();
```

### 28. Write an SQL query to show the top n (say 10) records of a table order by salary column./ Write an SQL query to show the First n (say 10) records of a table by salary column.
```
SELECT * FROM Worker w 
ORDER BY SALARY DESC LIMIT 10;
```

Second Part:
```
SELECT * FROM Worker w 
ORDER BY SALARY LIMIT 10;
```

### 29. Write an SQL query to determine the nth (say n=5) highest salary from a table.
```
SELECT SALARY FROM Worker
ORDER BY SALARY DESC LIMIT 4,1
```

### 30. Write an SQL query to fetch the list of employees with the same salary.
```
SELECT DISTINCT w.FIRST_NAME, w.WORKER_ID, w.SALARY
FROM Worker w , Worker w2 
WHERE w.SALARY = w2.SALARY  and w.WORKER_ID != w2.WORKER_ID ;
```

### 31. Write an SQL query to determine the 5th highest salary without using TOP or limit method.

```
SELECT Salary
FROM Worker W1
WHERE 4 = (
 SELECT COUNT( DISTINCT ( W2.Salary ) )
 FROM Worker W2
 WHERE W2.Salary >= W1.Salary
 );
```

### 32. Write an SQL query to show the second highest salary from a table.
```
SELECT MAX(SALARY) 
from Worker w 
where SALARY  NOT IN (
SELECT MAX(SALARY)
FROM Worker w2 
);
```

### 33. Write an SQL query to show one row twice in results from a table.
```
select FIRST_NAME, DEPARTMENT from worker W where W.DEPARTMENT='HR' 
union all 
select FIRST_NAME, DEPARTMENT from Worker W1 where W1.DEPARTMENT='HR';
```

### 34. Write an SQL query to fetch the first 50% records from a table.

```
SELECT * FROM Worker w 
WHERE WORKER_ID <= 
(SELECT COUNT(WORKER_ID)/2 FROM Worker w2 );
```

### 35. Write an SQL query to fetch the departments that have less than five people in it.

```
SELECT DEPARTMENT, COUNT(WORKER_ID) as 'Number of Workers' 
FROM Worker 
GROUP BY DEPARTMENT 
HAVING COUNT(WORKER_ID)<3;
````

### 36. Write an SQL query to show all departments along with the number of people in there.

```
SELECT DEPARTMENT, COUNT(WORKER_ID) AS "Number of workers"
FROM Worker w 
GROUP BY DEPARTMENT ;
```

### 37. Write an SQL query to show the last record from a table.
- FIRST METHOD:

```
SELECT * FROM Worker w 
WHERE WORKER_ID = 
(SELECT MAX(WORKER_ID) FROM Worker w2 );
```

- SECOND METHOD:
    
```
SELECT * FROM Worker w 
ORDER BY WORKER_ID DESC LIMIT 1;
```